# PANDAS

In [ ]:
# Agenda...
# What is pandas?
# What is Data Frame?
# what is Data Series?
# Different operatiosn in Pandas.

In [ ]:
# Pandas is an open source.BSD-licenced liabrary providing high performance, easy-to-use data structure and data analysis for python programming language.

In [2]:
# imporing liabrary
import pandas as pd
import numpy as np

In [74]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=["row1","row2","row3","row4","row5"],columns=["col1","col2","col3","col4"])

In [75]:
df

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [5]:
# we can import this to a csv or excel file as well
df.to_csv("test1.csv")
df.to_excel("test2.xlsx")

In [ ]:
# Accesing the elements
# There are two methods to access the elements. i. loc-- Row wise ii. iloc both row and column wise

In [7]:
df.loc["row1"]

col1    0
col2    1
col3    2
col4    3
Name: row1, dtype: int32

In [8]:
type(df.loc["row1"])

pandas.core.series.Series

In [9]:
# Data Frame should must have contains more than one row and more than one column
# But Series only contains a single row or single column.

In [12]:
df.loc["row5","col1"]

16

In [13]:
df.iloc[:,:] # all rows and all columns

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [14]:
df.iloc[0:2,0:2]

      col1  col2
row1     0     1
row2     4     5

In [17]:
df.iloc[:1,:2]

      col1  col2
row1     0     1

In [18]:
type(df.iloc[:,:]) # datatype if DataFrame becouse it contains values in a tabular form.

pandas.core.frame.DataFrame

In [24]:
df.iloc[0:2,0]

row1    0
row2    4
Name: col1, dtype: int32

In [25]:
type(df.iloc[0:2,0]) # data tuype is series

pandas.core.series.Series

In [26]:
df.iloc[:,1:] # starting from column index 1

      col2  col3  col4
row1     1     2     3
row2     5     6     7
row3     9    10    11
row4    13    14    15
row5    17    18    19

In [34]:
# converting Dara Frames into Array- just removes column and row indexes.
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [39]:
df["col2"].value_counts # returns unique no of values

<bound method IndexOpsMixin.value_counts of row1     1
row2     5
row3     9
row4    13
row5    17
Name: col2, dtype: int32>

In [41]:
df["col2"].unique()

array([ 1,  5,  9, 13, 17])

In [38]:
# Checking null values
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
dtype: int64

In [42]:
df[["col1","col2"]]

      col1  col2
row1     0     1
row2     4     5
row3     8     9
row4    12    13
row5    16    17

In [43]:
df*2

      col1  col2  col3  col4
row1     0     2     4     6
row2     8    10    12    14
row3    16    18    20    22
row4    24    26    28    30
row5    32    34    36    38

In [44]:
df/2

      col1  col2  col3  col4
row1   0.0   0.5   1.0   1.5
row2   2.0   2.5   3.0   3.5
row3   4.0   4.5   5.0   5.5
row4   6.0   6.5   7.0   7.5
row5   8.0   8.5   9.0   9.5

In [45]:
df%2

      col1  col2  col3  col4
row1     0     1     0     1
row2     0     1     0     1
row3     0     1     0     1
row4     0     1     0     1
row5     0     1     0     1

In [46]:
df>2

       col1   col2   col3  col4
row1  False  False  False  True
row2   True   True   True  True
row3   True   True   True  True
row4   True   True   True  True
row5   True   True   True  True

In [76]:
df1=df[df>2]

In [77]:
df1.isnull().sum()

col1    1
col2    1
col3    1
col4    0
dtype: int64

In [78]:
# reading data from csv file
df=pd.read_csv("insurance.csv")

In [79]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 57.6+ KB

In [81]:
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [82]:
test1_csv=pd.read_csv("test1.csv",sep=";")

In [83]:
test1_csv.head()

  Unnamed: 0  col1  col2  col3  col4
0       row1     0     1     2     3
1       row2     4     5     6     7
2       row3     8     9    10    11
3       row4    12    13    14    15
4       row5    16    17    18    19

In [84]:
df["sex"].value_counts()

male      676
female    662
Name: sex, dtype: int64

In [85]:
df1=df[df["age"]>27]

In [86]:
df1

      age     sex     bmi  children smoker     region      charges
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
5      31  female  25.740         0     no  southeast   3756.62160
6      46  female  33.440         1     no  southeast   8240.58960
...   ...     ...     ...       ...    ...        ...          ...
1329   52    male  38.600         2     no  southwest  10325.20600
1330   57  female  25.740         2     no  southeast  12629.16560
1332   52  female  44.700         3     no  southwest  11411.68500
1333   50    male  30.970         3     no  northwest  10600.54830
1337   61  female  29.070         0    yes  northwest  29141.36030

[976 rows x 7 columns]

In [87]:
df.corr()

               age       bmi  children   charges
age       1.000000  0.109272  0.042469  0.299008
bmi       0.109272  1.000000  0.012759  0.198341
children  0.042469  0.012759  1.000000  0.067998
charges   0.299008  0.198341  0.067998  1.000000

In [1]:
from io import StringIO,BytesIO

In [2]:
data=('col1,col2,col3\n'
     'b,c,1\n'
     'e,f,2\n'
     'y,z,3\n')

In [7]:
type(data)

str

In [8]:
df=pd.read_csv(StringIO(data))

In [9]:
df

  col1 col2  col3
0    b    c     1
1    e    f     2
2    y    z     3

In [11]:
# To retrieve only needed columns
df=pd.read_csv(StringIO(data),usecols=["col1","col2"])

In [12]:
df

  col1 col2
0    b    c
1    e    f
2    y    z

In [17]:
data=('a,b,c,d\n'
     '1,2,3,4\n'
     '4,5,6,7\n'
     '10,11,12,13')

In [18]:
data

'a,b,c,d\n1,2,3,4\n4,5,6,7\n10,11,12,13'

In [24]:
df=pd.read_csv(StringIO(data),dtype=object)

In [25]:
df

    a   b   c   d
0   1   2   3   4
1   4   5   6   7
2  10  11  12  13

In [28]:
type(df['a'][1])

str

In [29]:
df=pd.read_csv(StringIO(data),dtype=int)

In [30]:
type(df['a'][1])

numpy.int32

In [31]:
df=pd.read_csv(StringIO(data),dtype=float)

In [32]:
type(df['a'][1])

numpy.float64

In [39]:
# we can specify diffrent datatype to diffrenet columns
df=pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':object,'d':'Int64'})

In [40]:
df

    a     b   c   d
0   1   2.0   3   4
1   4   5.0   6   7
2  10  11.0  12  13

In [42]:
df.dtypes

a      int32
b    float64
c     object
d      Int64
dtype: object

In [43]:
data=('index,fruit,kg,cost\n'
     '1,apple,5,250\n'
     '2,grapes,4,400\n'
     '4,orange,6,120')

In [44]:
df=pd.read_csv(StringIO(data))

In [45]:
df

   index   fruit  kg  cost
0      1   apple   5   250
1      2  grapes   4   400
2      4  orange   6   120

In [46]:
# I want my index column (0th column) should be my index 
df=pd.read_csv(StringIO(data),index_col=0)

In [47]:
df

        fruit  kg  cost
index
1       apple   5   250
2      grapes   4   400
4      orange   6   120

In [48]:
df=pd.read_csv(StringIO(data),index_col=1)

In [49]:
df

        index  kg  cost
fruit
apple       1   5   250
grapes      2   4   400
orange      4   6   120

In [62]:
data=('a,b,c\n'
         '1,apple,bat,\n'
          '2,grapes,cow,'
     )

In [63]:
df=pd.read_csv(StringIO(data))
# After , no values so takes NaN and first value considered as index , to avoid this

In [64]:
df

        a    b   c
1   apple  bat NaN
2  grapes  cow NaN

In [65]:
df=pd.read_csv(StringIO(data),index_col=False)

In [66]:
df

   a       b    c
0  1   apple  bat
1  2  grapes  cow

In [70]:
df=pd.read_csv(StringIO(data),usecols=['b','c'],index_col=False)

In [71]:
df

        b    c
0   apple  bat
1  grapes  cow

In [78]:
data=('a,b\n"Hello,\\"Bob\\",nice to see you",5'
          
     )

In [79]:
df=pd.read_csv(StringIO(data))

In [80]:
df

                             a  b
Hello,\Bob\"  nice to see you"  5

In [81]:
df=pd.read_csv(StringIO(data),escapechar='\\')

In [82]:
df

                             a  b
0  Hello,"Bob",nice to see you  5

In [83]:
df=pd.read_csv('http://download.bls.gov/pub/time.series/cu/cu.item',sep='\t') # tab separator

In [84]:
df

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,399
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,374
4,SA0L1,All items less food,1,T,358
...,...,...,...,...,...
394,SS68023,Tax return preparation and other accounting fees,4,T,352
395,SSEA011,College textbooks,3,T,314
396,SSFV031A,Food at elementary and secondary schools,3,T,122
397,SSGE013,Infants' equipment,3,T,355
398,SSHJ031,Infants' furniture,3,T,165

In [96]:
# how to read Jason file
data='{"emp_name":"sarat","email_id":"saratsaisanama@gmail.com","job_profie":[{"title1":"teamlead","title2":"develop"}]}'

In [97]:
pd.read_json(data)

,emp_name,email_id,job_profie
0,sarat,saratsaisanama@gmail.com,"{'title1': 'teamlead', 'title2': 'develop'}"

In [3]:
# How to read Html file
url='https://www.fdic.gov/bank/individual/failed/banklist.html'
df_html=pd.read_html(url) # it shows number of tables inside the url

In [10]:
df_html[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [18]:
url_mcc='https://en.wikipedia.org/wiki/mobile_country_code'
df=pd.read_html(url_mcc,match='Country',header=None)

In [19]:
df

[     Mobile country code                                    Country ISO 3166  \
 0                    289                                 A Abkhazia    GE-AB
 1                    412                                Afghanistan       AF
 2                    276                                    Albania       AL
 3                    603                                    Algeria       DZ
 4                    544  American Samoa (United States of America)       AS
 ..                   ...                                        ...      ...
 247                  452                                    Vietnam       VN
 248                  543                        W Wallis and Futuna       WF
 249                  421                                    Y Yemen       YE
 250                  645                                   Z Zambia       ZM
 251                  648                                   Zimbabwe       ZW

                                   Mobile network codes National MNC authority  \
 0             List of mobile network codes in Abkhazia                    NaN
 1          List of mobile network codes in Afghanistan                    NaN
 2              List of mobile network codes in Albania                    NaN
 3              List of mobile network codes in Algeria                    NaN
 4       List of mobile network codes in American Samoa                    NaN
 ..                                                 ...                    ...
 247        List of mobile network codes in the Vietnam                    NaN
 248  List of mobile network codes in Wallis and Futuna                    NaN
 249          List of mobile network codes in the Yemen                    NaN
 250             List of mobile network codes in Zambia                    NaN
 251           List of mobile network codes in Zimbabwe                    NaN

                       Remarks
 0    MCC is not listed by ITU
 1                         NaN
 2                         NaN
 3                         NaN
 4                         NaN
 ..                        ...
 247                       NaN
 248                       NaN
 249                       NaN
 250                       NaN
 251                       NaN

 [252 rows x 6 columns]]

In [22]:
# reading excel file, we can read excel by mentioning sheet name. by default it picks up 0th sheet.
df=pd.read_excel("test2.xlsx")

In [23]:
df

  Unnamed: 0  col1  col2  col3  col4
0       row1     0     1     2     3
1       row2     4     5     6     7
2       row3     8     9    10    11
3       row4    12    13    14    15
4       row5    16    17    18    19

# Pickling

In [ ]:
# Pickling- saving the model into the disk which can be used for deployment.

In [24]:
df.to_pickle('df')

In [25]:
df1=pd.read_pickle('df')

In [26]:
df1

  Unnamed: 0  col1  col2  col3  col4
0       row1     0     1     2     3
1       row2     4     5     6     7
2       row3     8     9    10    11
3       row4    12    13    14    15
4       row5    16    17    18    19